wsig-examples/src/com/tilab/wsig/examples/xml/FacFunctions-testFac.xml

<?xml version="1.0" encoding="UTF-8" ?> 
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:FacFunctions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:fac soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <number xsi:type="xsd:int">6</number>
      </urn:fac>
   </soapenv:Body>
</soapenv:Envelope>
